export const obj = {
   192 : "#coska",
    49: "#n1",
    50: "#n2",
    51: "#n3",
    52: "#n4",
    53: "#n5",
    54: "#n6",
    55: "#n7",
    56: "#n8",
    57: "#n9",
    48: "#n0",
    189: "#n-",
    187: "#nequal",

    81: "#bq",
    87: "#bw",
   69: "#be",
   82:  "#br",
   84: "#bt",
   89: "#by",
   85: "#bu",
   73: "#bi",
   79:"#bo",
   80:"#bp",
   220: "#brows2last",

   65:"#ba",
   83:"#bs",
   68:"#bd",
   70:"#bf",
   71:"#bg",
   72:"#bh",
   74:"#bj",
   75:"#bk",
   76:"#bl",
   186:"#btz",
   222:"#bcoscaUp",


   90:"#bz",
   88:"#bx",
   67:"#bc",
   86:"#bv",
   66:"#bb",
   78:"#bn",
   77:"#bm",
   190:"#btoch",
   191:"#bslesh",

   32:"#space",

   219: "#bleftcwad",
   221: "#brightcwad",
   188: "#bzap",
   38:"#bUp",
   37:"#left",
   40:"#down",
   39:"#right",


}

export const spec = {
   "ShiftLeft": "#shift1",
   "ShiftRight": "#shift2",
   "ControlLeft": "#ctrl1",
   "ControlRight":"#ctrl2",
   "AltLeft": "#alt1",
   "AltRight": "#alt2",
   "Delete": "#del",
   "Backspace": "#backSpace",
   "Tab": "#tab",
   "Enter":"#enter",
   "MetaLeft":"#win",
}


export const specShift = {
   "#coska":["`", "~","ё", "Ё"],
   "#n1": ["1", "!","1", "!"],
   "#n2": ["2", "@","2", "\""],
   "#n3": ["3", "#","3", "№"],
   "#n4": ["4", "$","4", ";"],
   "#n5": ["5", "%","5", "%"],
   "#n6": ["6", "^","6", ":"],
   "#n7": ["7", "&","7", "?"],
   "#n8": ["8", "*","8", "*"],
   "#n9": ["9", "(","9", "("],
   "#n0": ["0", ")","0", ")"],
   "#n-": ["-", "_","-", "_"],
   "#nequal": ["=", "+","=", "+"],
   "#bleftcwad":["[", "{","х", "Х"],
   "#brightcwad": ["]", "}","ъ", "Ъ"],
   "#brows2last":["\\", "|","\\", "/"],
   "#btz":[";", ":","ж", "Ж"],
   "#bcoscaUp":["'", "\"","э", "Э"],
   "#bzap":[",", "<","б", "Б"],
   "#btoch":[".", ">","ю", "Ю"],
   "#bslesh":["/", "?",".", ","],
}





export const enRu = {
  "#coska":["`", "ё"],
  "#bq": ["q", "й"],
  "#bw": ["w", "ц"],
  "#be": ["e", "у"],
  "#br": ["r", "к"],
  "#bt": ["t", "е"],
  "#by": ["y", "н"],
  "#bu": ["u", "г"],
  "#bi": ["i", "ш"],
  "#bo": ["o", "щ"],
  "#bp": ["p", "з"],
  "#bleftcwad": ["[", "х"],
  "#brightcwad": ["]", "ъ"],
  "#brows2last": ["\\", "\\"],
  

  "#ba": ["a", "ф"],
  "#bs": ["s", "ы"],
  "#bd": ["d", "в"],
  "#bf": ["f", "а"],
  "#bg": ["g", "п"],
  "#bh": ["h", "р"],
  "#bj": ["j", "о"],
  "#bk": ["k", "л"],
  "#bl": ["l", "д"],
  "#btz": [";", "ж"],
  "#bcoscaUp": ["'", "э"],

  "#bz": ["z", "я"],
  "#bx": ["x", "ч"],
  "#bc": ["c", "с"],
  "#bv": ["v", "м"],
  "#bb": ["b", "и"],
  "#bn": ["n", "т"],
  "#bm": ["m", "ь"],
  "#bzap":[",", "б"],
  "#btoch": [".", "ю"],
  "#bslesh": ["/", "."],
} 




export default function bar() {
   console.log("Gg")
 }